In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## Reindexing
A critical method on pandas object is reindex, which means to create a new object with the data conformed to a new index.

In [2]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [3]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
# Calling reindex on this Series rearranges the data according to the new index,
# introducing missing values if any index values were not already present
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [5]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [6]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [7]:
# For ordered data like time series, it may be desirable to do some interpolation or filling of values when reindexing.
# The method option allows us to do this, using a method such as ffill which forward fill the values
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [8]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [9]:
# With DataFrame, reindex can alter either the (row) index, columns or boht. =
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

In [10]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [11]:
# The columns can be reindexed using the columns keywrord
states = ['Texas', 'Utah', 'California']

In [12]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [13]:
# Both can be reindexed in one shot, though interpolation will only apply row-wise (axis=0)
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill')

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [14]:
frame.loc[['a', 'b', 'c', 'd'], states]

/home/parag/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

## Dropping entries from an axis

In [15]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [16]:
new_obj = obj.drop('c')

In [17]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [18]:
data = DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Coloardo', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [19]:
data.drop(['Coloardo', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Coloardo    4      6     7
Utah        8     10    11
New York   12     14    15

In [21]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Coloardo    4      6
Utah        8     10
New York   12     14

## Indexing, selection, and filtering

In [22]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [23]:
obj['b']

1.0

In [24]:
obj[1]

1.0

In [25]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [26]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [27]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [28]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [29]:
# Slicing with labels behaves differently than normal Python slicing in that the endpoint is inclusive
obj['b':'c'] = 5

In [30]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [31]:
data = DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [32]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [33]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [34]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [35]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [36]:
data[data['three'] >  5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [37]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [38]:
data[data < 5] = 0

In [39]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [41]:
data.loc[['Colorado', 'Utah'], ['two', 'three']]

          two  three
Colorado    5      6
Utah        9     10

In [42]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [43]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [44]:
data.ix[data.three > 5, :3]

/home/parag/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

## Arithmetic and data alignment

In [45]:
# When adding together objects, if any index pairs are not the same,
# the respective index in the result will be the union of the index pairs
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [46]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [47]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [48]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [49]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [50]:
# The internal data alignment introduces NA values in the indices that don't overlap
# Missing values propogate in arithmetic computations

In [51]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])

In [52]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [53]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [54]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [55]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

### Arithmetic methods with fill values

In [56]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

In [57]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [58]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [59]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [60]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [61]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [62]:
# Relatedly, when reindexing a Series or DataFrame, you can also specify a different fill value
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Operation between DataFrame and Series

In [63]:
arr = np.arange(12.).reshape((3, 4))

In [64]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [65]:
arr[0]

array([0., 1., 2., 3.])

In [66]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [67]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [68]:
series = frame.iloc[0]

In [69]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [70]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [71]:
# By default, arithmetic between DataFrame and Series matches the index of the Series on the DataFrame's columns
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [72]:
# If an index value is not found in either the DataFrame's columns or the Series's index,
# the object will reindexed to form the union
series2 = Series(range(3), index=['b', 'e', 'f'])

In [73]:
series2

b    0
e    1
f    2
dtype: int64

In [74]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [75]:
# If you want to instead broadcast over the columns, matching on the rows, you have to use one of the arithmetic method
series3 = frame['d']

In [76]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [77]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [78]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping

In [79]:
# NumPy ufuncs (element-wise array methods) work fine with pandas objects
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [80]:
frame

               b         d         e
Utah    0.079970  0.448557 -0.745833
Ohio    0.840395  0.033694 -0.415563
Texas   1.719718 -1.471049 -0.780623
Oregon -1.043978 -1.489098 -0.785214

In [81]:
np.abs(frame)

               b         d         e
Utah    0.079970  0.448557  0.745833
Ohio    0.840395  0.033694  0.415563
Texas   1.719718  1.471049  0.780623
Oregon  1.043978  1.489098  0.785214

In [82]:
# Another frequent operation is applying a function on 1D arrays to each column or row,
f = lambda x: x.max() - x.min()

In [83]:
frame.apply(f)

b    2.763697
d    1.937656
e    0.369652
dtype: float64

In [84]:
frame.apply(f, axis=1)

Utah      1.194390
Ohio      1.255957
Texas     3.190768
Oregon    0.703884
dtype: float64

In [85]:
# The function passed to apply need not return a scalar value, it can also return a Series with multiple values
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [86]:
frame.apply(f)

            b         d         e
min -1.043978 -1.489098 -0.785214
max  1.719718  0.448557 -0.415563

In [87]:
# Element wise Python functions can be used, too.
# Compute a formatted string from each floating point value in frame.
fromat = lambda x: '%.2f'%x

In [88]:
frame.applymap(fromat)

            b      d      e
Utah     0.08   0.45  -0.75
Ohio     0.84   0.03  -0.42
Texas    1.72  -1.47  -0.78
Oregon  -1.04  -1.49  -0.79

In [89]:
# The reason for the name applymap is that Series has a map method for applying an element-wise function
frame['e'].map(fromat)

Utah      -0.75
Ohio      -0.42
Texas     -0.78
Oregon    -0.79
Name: e, dtype: object

### Sorting and ranking
Sorting a data set by some criterion is another important built-in operation.

In [90]:
# To sort lexicographically by row or column index, use the sort_index method, which returns a new sorted object
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [91]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [92]:
frame = DataFrame(np.arange(8).reshape(2, 4), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])

In [93]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [94]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [95]:
# The data is sorted ascending order by default, but can be sorted in descending order,
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [96]:
# To sort a Series by its values, use its order method
obj = Series([4, 7, -3, 2])

In [97]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [98]:
# Any missing values are sorted to the end of the Series by default
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [99]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [100]:
# On Dataframe you may want to sort by the values in one or more columns. 
# To do so, pass one or more column names to the by option
frame = DataFrame({'b': [4, 7, -3, 2], 'a':[0, 1, 0, 1]})

In [101]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [102]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [103]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Ranking is closely related to sorting, assigning ranks from one through the number of valid data points in an array. It is similar to the indirect sort indices produced by numpy.argsort, except that ties are broken according to a rule. The rank methods for Series and DataFrame are the place to look; by default rank breaks ties by assigning each group the mean rank

In [104]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [105]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [106]:
# Rank can also be assigned according to the order they're observed in the data
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [107]:
# Naturally, you can rank in descending order, too
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [108]:
frame = DataFrame({
    'b': [4.3, 7, -3, 2],
    'a': [0, 1, 0, 1],
    'c': [-2, 5, 8, -2.5]
})

In [109]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [110]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis indexes with duplicate values

In [111]:
# Many pandas functions (like reindex) require that the labels be unique, it's not mandatory.
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [112]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [113]:
# The index's is_unique property can tell you whether its values are unique or not
obj.index.is_unique

False

In [114]:
obj['a']

a    0
a    1
dtype: int64

In [115]:
obj['c']

4

In [116]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [117]:
df

          0         1         2
a  0.221299  0.403608  0.037617
a  0.384063  0.114768  1.561908
b  0.609644 -0.791771 -1.170766
b  1.403736  0.228528  0.232587

In [118]:
df.loc['b']

          0         1         2
b  0.609644 -0.791771 -1.170766
b  1.403736  0.228528  0.232587

### Summarizing and Computing Descriptive Statistics
pandas objects are equipped with a set of common mathematical and statistical methods. Most of the fills into the category of <i>reductions or summary statistics</i>, methods that extract a single value (like sum or mean) from a Series or a Series of values from the rows or columns of a DataFrame. 
Compared with the equivalent methods of vanilla NumPy arrays, they are built from the ground up to exclude missing data. Consider a small DataFrame

In [119]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])

In [120]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [121]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [122]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [123]:
# NA values are excluded unless the entire slice (row or column in this case) is NA.
# This can be disbaled using skipna option
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [124]:
# Some methods, like idxmin and idxmax, return indirect statics like the index value where the minimum or maximum value are attained
df.idxmax()

one    b
two    d
dtype: object

In [125]:
df.idxmin()

one    d
two    b
dtype: object

In [126]:
# Other methods are accumulations
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [127]:
# describe, produce mupltiple summary statistics in one shot
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [128]:
# On non-numeric data, describe produces alternate summary statistcs
obj = Series(['a', 'a', 'b', 'c']*4)

In [129]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

In [130]:
# Some summray statistcs, like correalation and covarience, are computed from pairs of arguments
# Let's consider some DataFrames of stock prices and volumes obtained from Yahoo! Finance
import pandas_datareader.data as web

In [131]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')

In [132]:
price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})

In [133]:
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

In [134]:
# Compute precent changes of the price
returns = price.pct_change()

In [135]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2009-12-24  0.034340  0.004385  0.002587  0.011117
2009-12-28  0.012294  0.013326  0.005484  0.007098
2009-12-29 -0.011861 -0.003477  0.007058 -0.005571
2009-12-30  0.012147  0.005461 -0.013699  0.005376
2009-12-31 -0.004300 -0.012597 -0.015504 -0.004416

In [136]:
# The corr method of Series computes the correlation of the overlapping,
# non-NA, aligned-by-index values in two Series. Relatedly, cov computes covarience
returns.MSFT.corr(returns.IBM)

0.4943582498018529

In [137]:
returns.MSFT.cov(returns.IBM)

0.00021582150814135966

In [138]:
# DataFrame's corr and cov methods, on the other hand, returns a full correlation or covariance matrix as a DataFrame,
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.412392  0.423598  0.470676
IBM   0.412392  1.000000  0.494358  0.390689
MSFT  0.423598  0.494358  1.000000  0.443586
GOOG  0.470676  0.390689  0.443586  1.000000

In [139]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.001030  0.000254  0.000309  0.000303
IBM   0.000254  0.000369  0.000216  0.000142
MSFT  0.000309  0.000216  0.000516  0.000205
GOOG  0.000303  0.000142  0.000205  0.000580

In [140]:
# Using DataFrame's corrwith method, can compute pairwise correlations between DataFrame's columns or rows with another
# Series or DataFrame. Passing a Series returns a Series with the correlation value computed for each column
returns.corrwith(returns.IBM)

AAPL    0.412392
IBM     1.000000
MSFT    0.494358
GOOG    0.390689
dtype: float64

In [141]:
# Passing a DataFrame computes the coorelation of matching column names.
# Here, compute correlations of percent changes with volume
returns.corrwith(volume)

AAPL   -0.057665
IBM    -0.006592
MSFT   -0.014228
GOOG    0.062647
dtype: float64

In [142]:
# Passing axis=1 does things row-wise instead. 
# In all case data points are aligned by label before computing the correlations

### Unique Values, Value Counts, and Membership

In [143]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [144]:
uniques = obj.unique()

In [145]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [146]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [147]:
pd.value_counts(obj.values, sort=False)

a    3
d    1
c    3
b    2
dtype: int64

In [148]:
# isin is responsible for vectorized set memebership and can be very useful in filtering a data set down to a subset
# of values in a Series or column in a DataFrame
mask = obj.isin(['b', 'c'])

In [149]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [150]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [151]:
# In some case, to compute a histogram on multiple related columns in a DataFrame
data = DataFrame({
    'Qu1': [1, 3, 4, 3, 4],
    'Qu2': [2, 3, 1, 2, 3],
    'Qu3': [1, 5, 2, 4, 4]
})

In [152]:
# Passing pandas.value_counts to this DataFrame's apply function gives
result = data.apply(pd.value_counts).fillna(0)

In [153]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling Missing Data
Missing data is a common in most data analysis applications. One of the goals in desigining pandas was to make working with missing data as painless as possible. For example, all of the descriptive statistics on pandas objects exclude missing data.
pandas uses the floating point value NaN (Not a Number) to represent missing data in both floating as well as in non-floating point arrays. It is just used as sentinel that can be easily detected.

In [154]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [155]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [156]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [157]:
# The built-in Python None value is also treated as NA in object arrays
string_data[0] = None

In [158]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [159]:
from numpy import nan as NA

In [160]:
# dropna returns the Series with only the non-null data and index values
data = Series([1, NA, 3.5, NA, 7])

In [161]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [162]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [163]:
# With DataFrame objects, these are a bit more complex.
# You may want to drop rows or columns which are all NA or jsut those containing any NAs.
# dropna by defualt drops any row containing a missing value
data = DataFrame([
    [1., 6.5, 3.], [1., NA, NA],
    [NA, NA, NA], [NA, 6.5, 3.]
])

In [167]:
cleaned = data.dropna()

In [168]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [169]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [170]:
# Passing how='all' will only drop rows that all NA
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [171]:
# Droping columns in the same way is only a matter of passing axis = 1
data[4] = NA

In [172]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [173]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [174]:
# A releated way to filter out DataFrame rows tends to concern time series data.
# Suppose to keep only rows containing a certain number of obeservation.
# You can indicate this with the thresh argument
df = DataFrame(np.random.randn(7, 3))

In [175]:
df.iloc[:4, 1] = NA

In [176]:
df.iloc[:2, 2] = NA

In [177]:
df

          0         1         2
0 -1.154797       NaN       NaN
1  1.881343       NaN       NaN
2  0.338982       NaN  0.655289
3 -0.195598       NaN  2.149607
4  0.787056 -1.310363  0.786228
5  1.494221  0.128561  0.442246
6 -0.338724  1.587071  0.806988

In [178]:
df.dropna(thresh=3)

          0         1         2
4  0.787056 -1.310363  0.786228
5  1.494221  0.128561  0.442246
6 -0.338724  1.587071  0.806988

### Filling in Missing Data

In [179]:
df.fillna(0)

          0         1         2
0 -1.154797  0.000000  0.000000
1  1.881343  0.000000  0.000000
2  0.338982  0.000000  0.655289
3 -0.195598  0.000000  2.149607
4  0.787056 -1.310363  0.786228
5  1.494221  0.128561  0.442246
6 -0.338724  1.587071  0.806988

In [181]:
# Calling fillna with a dict you can use a different fill value for each column
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -1.154797  0.500000       NaN
1  1.881343  0.500000       NaN
2  0.338982  0.500000  0.655289
3 -0.195598  0.500000  2.149607
4  0.787056 -1.310363  0.786228
5  1.494221  0.128561  0.442246
6 -0.338724  1.587071  0.806988

In [182]:
# fillna returns a new object, but you can modifiy exisiting object in place
# alawys return a reference to the filled object
_ = df.fillna(0, inplace=True)

In [183]:
df

          0         1         2
0 -1.154797  0.000000  0.000000
1  1.881343  0.000000  0.000000
2  0.338982  0.000000  0.655289
3 -0.195598  0.000000  2.149607
4  0.787056 -1.310363  0.786228
5  1.494221  0.128561  0.442246
6 -0.338724  1.587071  0.806988

In [184]:
# The same interpolation methods available for reindexing can be used with fillna
df = DataFrame(np.random.randn(6, 3))

In [185]:
df.iloc[2:, 1] = NA; df.iloc[4:, 2] = NA

In [186]:
df

          0         1         2
0  0.660766  0.721695  1.552214
1 -0.847885  1.217061  0.119836
2 -0.437968       NaN -0.797776
3 -0.961735       NaN  0.684851
4  1.768625       NaN       NaN
5 -1.178431       NaN       NaN

In [187]:
df.fillna(method='ffill')

          0         1         2
0  0.660766  0.721695  1.552214
1 -0.847885  1.217061  0.119836
2 -0.437968  1.217061 -0.797776
3 -0.961735  1.217061  0.684851
4  1.768625  1.217061  0.684851
5 -1.178431  1.217061  0.684851

In [188]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.660766  0.721695  1.552214
1 -0.847885  1.217061  0.119836
2 -0.437968  1.217061 -0.797776
3 -0.961735  1.217061  0.684851
4  1.768625       NaN  0.684851
5 -1.178431       NaN  0.684851

In [189]:
data = Series([1., NA, 3.5, NA, 7])

In [190]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical Indexing
<i>Hierarchical Indexing</i> is an important feature of pandas enabling you to have multiple (two or more) index levels on an axis. It provide a way to worlk with higher dimensional data in a lower dimensional form

In [191]:
data = Series(np.random.randn(10), index=[
    ['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
    [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]
])

In [192]:
data

a  1    0.621057
   2   -0.057250
   3   -0.419772
b  1    0.144855
   2    0.782734
   3    0.404342
c  1    0.077654
   2   -0.744100
d  2   -0.644058
   3    0.744407
dtype: float64

In [193]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [195]:
data['b']

1    0.144855
2    0.782734
3    0.404342
dtype: float64

In [197]:
data['b': 'c']

b  1    0.144855
   2    0.782734
   3    0.404342
c  1    0.077654
   2   -0.744100
dtype: float64

In [198]:
data.loc[['b', 'd']]

b  1    0.144855
   2    0.782734
   3    0.404342
d  2   -0.644058
   3    0.744407
dtype: float64

In [199]:
data[:, 2]

a   -0.057250
b    0.782734
c   -0.744100
d   -0.644058
dtype: float64

In [200]:
# Hierarchical Indexing plays a critical role in reshaping data and group-based operations like forming a pivot table
# For eg, this data could be rearranged into a DataFrame using its unstack method
data.unstack()

          1         2         3
a  0.621057 -0.057250 -0.419772
b  0.144855  0.782734  0.404342
c  0.077654 -0.744100       NaN
d       NaN -0.644058  0.744407

In [202]:
# The inverse of unstack is stack
data.unstack().stack()

a  1    0.621057
   2   -0.057250
   3   -0.419772
b  1    0.144855
   2    0.782734
   3    0.404342
c  1    0.077654
   2   -0.744100
d  2   -0.644058
   3    0.744407
dtype: float64

In [204]:
# With a DataFrame, either axis caj uave a hierarchical index
frame = DataFrame(
    np.arange(12).reshape((4, 3)), 
    index = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
    columns = [['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']]
)

In [205]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [206]:
frame.index.names = ['key1', 'key2']

In [207]:
frame.columns.names = ['state', 'color']

In [208]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [209]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [211]:
# A MultiIndex can be created by itself and then reused
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colardo'], ['Green', 'Red', 'Green']], names=['state', 'color'])

MultiIndex(levels=[['Colardo', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

### Reordering and Sorting Levels

In [212]:
# The swaplevel takes two level numbers or names and return a new object with the levels interchanged
# (but the data is otherwise unalterd)
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [216]:
# sortlevel, on the other hand, sorts the data (stably) using only the values in a single leve
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [219]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary Statistics by Level

In [220]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [221]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's Columns

In [222]:
frame = DataFrame({
    'a': range(7), 'b': range(7, 0, -1),
    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
    'd': [0, 1, 2, 0, 1, 2, 3]
})

In [223]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [224]:
frame2 = frame.set_index(['c', 'd'])

In [225]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [226]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1